///字母 vs.它的值
///ASCII 美國國家標準資訊交換碼 (數字<->字母符號)
///2 4 8 16 32 64 128 256 (2的很多次方)
///Q: 26個英文字母,請問哪一個數字比較適合拿來用?
///A: 32最適合裝
///ASCII的設計理念:   32 + 32 + 32 + 32
///看不到 符號 大寫 小寫
///   32 + 32 = 64 A:65
///   32 + 32 + 32 = 96  a:97
#include <stdio.h>
int main()
{
    printf("%c : %d\n", 65, 65);
    printf("%c : %d\n", 66, 66);
    printf("%c : %d\n", 67, 67);
    printf("%c : %d\n", 'A', 'A' );
    printf("%c : %d\n", 'B', 'B' );
    printf("%c : %d\n", 'C', 'C' );
    printf("上面用數字 64 及單引號 'a' 的結果都一樣\n");
    printf("%c : %d\n", 97, 97);
    printf("%c : %d\n", 'a', 'a');
}
